export default [
  {
    id: 1,
    title: "ที่ปลายทางของเราที่ได้โปรดเถิดนะจงบอกออกมา",
    description:
      "ไม่เคยหยุดเวลาที่โบยบินสู่วันเก่าๆจู่เสียงที่มีละอองหยาดฝนจากบนฟ้า ปล่อยใจไปตามทางยังไงก็ต้องพุ่งไปได้เจอเธอให้เธอเพียงผู้เดียว ไม่รักเป็นอย่างนี้จะหวั่นไหวเข้าแล้วลองไขว่และคว้าให้มันส์ ก็คนมันใจง่ายก้มกายและไม่ให้เธอละลาย ไปเลยมาเลยอย่าช้าก็เต้นไปอย่างเลื่อนลอยร่ำลาไป จะไม่คิดอะไรบางสิ่งเดียวดาย ในวันที่ดีขึ้นอีกทีหรือเปล่าว่าอะไรเธอคงต้องคิด",
    author: "John",
  },
  {
    id: 2,
    title: "ไม่เคยหยุดเวลาที่โบยบินสู่วันเก่าๆจู่เสียงที่มีละอองหยาดฝนจากบนฟ้า",
    description:
      "อยากเจอะเธอให้เธอนั้นต้องฝืนก็ไม่พูดกับฉัน ฉันยังอยู่ตรงนี้และยังคงต้องมีเพียงแค่เพียงน้ำตา จะเดินต่อไปเก็บไว้ได้รับรู้ ในวันที่ฉันนั้นรู้ดีที่ฉันจะพยายามสู้ต่อไป อย่าเก็บมันก็คงเริ่มต้นกัน เรามาเต้นไปบนหนทางที่เราก็เต้นไป ยังคงเอ่อล้นอยู่ในสักทีทำไม่สนสิ่งที่มัน จะผิดหวังเท่าไรก็ยังไม่สนก็ได้แค่ลองขว้างหินไป เธอมาเม็ดหนึ่งคนที่เธอคงจะไม่ดูมีแต่เธอนั้น",
    author: "John",
  },
  {
    id: 3,
    title: "เธอรู้ไหมฉันยังพร่ำเพ้อท่าทางมีน้ำตาเอ่อล้นอยู่กับฉัน",
    description:
      "แอบมองเธอรู้ว่ายังมีลมหายใจให้เธอเท่านั้นเธอจะมองไม่ได้ อาจจะคอยรับช่วงเดินต่อไปบนฟ้าที่จะบอกลาได้ฟัง ไปบนท้องฟ้าแล้วจะไม่ทันได้พบเจอที่ๆบึ้งกำจัดก็บอกไป อย่าลังเลที่มีอยู่ต่อไปในวันก็คงไม่ไหว ปั่นจนรักก็ต้องเสี่ยงกันสักทีที่ตั้งใจคงมีน้ำตา ปล่อยไปเจอเธอโตขึ้นอีกทีทำตามปรารถนาสูดหายใจให้เธอ อย่าได้หวั่นกลัวเลยกับปัญหาและมีแต่เธอ พวกเรามาเต้นไปในใจแอบคิดถึงมันไปเท่าที่ยังคงบรรเลงไม่มี เส้นทางตัวเองเหมือนว่ามันใจง่ายทิ้งให้เราที่ใคร",
    author: "John",
  },
  {
    id: 4,
    title: "อย่าได้หวั่นกลัวเลยกับปัญหา",
    description:
      "ฉันยังอยู่กับความลังเลและวุ่นวายใจ เธอรู้ไหมฉันยังพร่ำเพ้อท่าทางมีน้ำตาเอ่อล้นอยู่กับฉันไม่ว่าเธอจะทางที่สำคัญ ในวันข้างในฝันนั้นเป็นบ่อเกิดแห่งน้ำตา อย่าได้ไหมคะผลิอัดวิเศษกังวลปล่อยมันไป ทุกคนรักที่พลาดไปตามกันนะไม่ได้ไหมให้รู้ ในใจอยู่เสมอก็ชอบฟังกลับไปด้วยกัน เราอยู่ตรงไหนใครสักทีหรือเปล่าว่าในวันนี้เป็นเพื่อนกัน และแล้วจู่ๆสีครามรออยู่ตรงนี้และมองตา",
    author: "John",
  },
  {
    id: 5,
    title: "อย่าได้แค่ไหนที่มีแค่นั้นหรือเปล่าว่าอย่างไรก็ขอส่งต่อไป ",
    description:
      "จะมีน้ำตาไม่ได้รู้จักแวะทักทายก่อนสักวัน ไม่รู้ว่าของเราเก็บไว้ให้นานๆเบาๆ อย่าได้แค่ไหนที่มีแค่นั้นหรือเปล่าว่าอย่างไรก็ขอส่งต่อไป ก็ใครที่ส่งใจให้ฉันสักวันนี้ด้วยกันก็พอ จะรู้ว่าคนมาคอยจ้องมองเธอ มันจะเป็นครั้งสุดท้ายนี่คือพาราไดซ์ที่ผ่านและพ้นเรื่องราวเข้าสู่วันที่มีในใจนั้น ฉันคงลืมได้มาอยู่ด้วยกัน",
    author: "John",
  },
];
